
// ★ 자바의 개요 및 특징 ★

// 단일행 주석문(comment) → 라인 단위 주석문

/*
다중행
주석문
처리
→ 블럭 단위 주석문
*/

// 클래스의 이름은 『Test001』
// 자바 프로그램의 클래스 이름은 첫 글자를 『대문자』로 시작 
// 소스 코드 저장 시 클래스의 이름과 동일한 파일 이름으로 저장. (단, 확장자는 『.java』)
public class Test001
{
	// 메소드는 클래스 안에서만 유효하다.
	// main() 이라는 이름을 가진 메소드 ← 자바 인터프리터가 처음 찾는 메소드
	public static void main(String[] args)
	{
		//
		// 당분간 코딩해야 할 영역
		//
		
		System.out.println("1");
		
		//구급약통.내복약.타이레놀();
		
		System.out.print("김정현\n");
	
		//	『System』이라는 공구장롱 안에
		//  『out』이라는 공구통 안에
		//  『println()』이라는 도구(메소드)를 꺼내어 사용하는 개념
		//   → System 클래스의 out 객체의 println() 메소드
			
		
	
	}
}